In [1]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.738962 -0.441203
1    a  two -1.680433 -0.144071
2    b  one  0.770785 -0.073775
3    b  two -0.427515 -0.596641
4    a  one  0.199539 -1.039488

In [5]:
#利用階層式索引建立群組
df1=df.set_index(['key1', 'key2'])
df1

              data1     data2
key1 key2
a    one  -0.738962 -0.441203
     two  -1.680433 -0.144071
b    one   0.770785 -0.073775
     two  -0.427515 -0.596641
a    one   0.199539 -1.039488

In [8]:
df1.sum(level=['key1','key2'])

              data1     data2
key1 key2
a    one  -0.539423 -1.480691
     two  -1.680433 -0.144071
b    one   0.770785 -0.073775
     two  -0.427515 -0.596641

In [9]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.315162  0.970493
1    a  two  0.549157 -0.532404
2    b  one  1.340029  0.711270
3    b  two -1.346771  1.509987
4    a  one  0.048449  1.743334

In [12]:
#groupby()方法,建立群組
grouped = df['data1'].groupby(df['key1'])

In [13]:
grouped.mean()

key1
a    0.637590
b   -0.003371
Name: data1, dtype: float64

In [14]:
grouped.max()

key1
a    1.315162
b    1.340029
Name: data1, dtype: float64

In [15]:
grouped.min()

key1
a    0.048449
b   -1.346771
Name: data1, dtype: float64

In [16]:
grouped.sum()

key1
a    1.912769
b   -0.006742
Name: data1, dtype: float64

In [17]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.290677 -0.615921
1    a  two  0.643781  0.701089
2    b  one -0.450135 -2.872995
3    b  two -0.315426 -0.672185
4    a  one -1.151542 -0.158862

In [18]:
grouped = df.groupby('key1')
grouped

In [19]:
for name,group in grouped:
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.290677 -0.615921
1    a  two  0.643781  0.701089
4    a  one -1.151542 -0.158862
b
  key1 key2     data1     data2
2    b  one -0.450135 -2.872995
3    b  two -0.315426 -0.672185

In [22]:
pieces=dict(list(grouped))
pieces

{'a':   key1 key2     data1     data2
 0    a  one -1.290677 -0.615921
 1    a  two  0.643781  0.701089
 4    a  one -1.151542 -0.158862, 'b':   key1 key2     data1     data2
 2    b  one -0.450135 -2.872995
 3    b  two -0.315426 -0.672185}

In [23]:
pieces['a']

  key1 key2     data1     data2
0    a  one -1.290677 -0.615921
1    a  two  0.643781  0.701089
4    a  one -1.151542 -0.158862

In [24]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.450135 -2.872995
3    b  two -0.315426 -0.672185

In [25]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.928382  1.205534
1    a  two  0.057864 -0.334989
2    b  one  2.012147  0.260086
3    b  two -0.893116  1.848047
4    a  one -1.464656 -1.140170

In [26]:
grouped = df.groupby('key2')
grouped.sum()

         data1     data2
key2
one   1.475873  0.325451
two  -0.835252  1.513058